/*– Взяти масив з 10 чисел або створити його.
Вивести в консоль тільки ті елементи, значення яких є парними.
– Взяти масив з 10 чисел або створити його. Створити 2-й порожній масив.
За допомогою будь-якого циклу скопіювати значення одного масиву в інший.*/

let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
for (const number of arr) {
    if (number % 2 === 0) {
        console.log(number);
    }
}

let emptyArr = [];
for (let i = 0; i < arr.length; i++) {
    emptyArr[i] = arr[i];
}

console.log(emptyArr);